public class program {
    public static void main(String[] args) {
        // Доработайте программу в свободном стиле.
        // Можно сравнить 2 автомобиля между собой
        // Или пусть авто заедет за фруктами :-)
        // Добавьте несколько произвольных методов и свойств
        // <br>
        // ДОП: Сделать гонки:
        // - задаём растояние
        // - едут до финиша.
        // Сказать кто победит.

        // <br>
        // Кто не доделал - задания на семинаре:
        // 1)
        // Напишите класс Car.
        // В классе должна храниться следующая информация:
        // название автомобиля - model;
        // год выпуска - year;
        // стоимость - price;
        // цвет - color;
        // объем двигателя - power.
        // <br>
        // 2) Доработайте класс Car.
        // Добавьте в класс Car метод getInfo без параметров, который будет печать на
        // экране значения полей объекта класса model , power и yeare.
        // <br>
        // 3) Доработайте класс Car.
        // В классе должна храниться следующая информация:
        // Свойство - которое говорит заведен авто или нет
        // Метод - запуска автомобиля
        // Метод - остановки автомобиля
        // Метод дороги - при вызове, в качестве аргумента передаем место назначения
        // И если авто заведён - выводим, что мы на такой-то авто едем место назначения
        // Если не заведён - сообщить, что авто не заведено. И мы не можем ехать

        Car someCar = new Car("Kio rio", 2016, 900000.0, "Carbon grey", 1.6);
        someCar.getInfo();
        someCar.road("город Москва");
        someCar.startCar();
        someCar.road("город Москва");
        someCar.drownOutCar();

        Sportcar first = new Sportcar();
        Sportcar second = new Sportcar();
        first.getName();
        second.getName();
        Sportcar.race(first, second, 500);
    }
}